// 10.23.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <vector>

void print(const std::vector<int>& array)
{
    std::cout << array.size() << '\n';
}
int main()
{
    std::vector array{ 5 };
    std::vector<int> array1(5);

    std::cout << array.size() << ' ';
    std::cout << array1.size();
    std::cout << '\n';

    for (int element : array)
    {
        std::cout <<  ' ' << element << ' ';
    }
    std::cout << '\n';

    for (int element : array1)
    {
        std::cout << element << ' ';
    }
    //print(array);
    return 0;   
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
