// 10.25.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <array>
int main()
{
    std::array arr{ 13,23,34,45,56,67,78,89,90 };


    std::cout << "Enter the number please: ";
    int search{};
    int replace{};
    std::cin >> search >> replace;


    auto found{ std::find(arr.begin(), arr.end(), search) };


    if (found == arr.end())
    {
        std::cout << "Couldn't find the number!" << search << '\n';
    }
    else
    {
        *found = replace;
    }


    for (int i : arr)
    {
        std::cout << i << ' ';
    }



    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
